# brew bundle install --file=./Brewfile => This command will install all the packages listed in the Brewfile
tap "cirruslabs/cli"
tap "homebrew/bundle"
tap "homebrew/command-not-found", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-command-not-found.git"
tap "shopify/shopify"
brew "openjdk"
brew "apktool"
brew "dex2jar"
brew "eza"
brew "fd"
brew "tesseract"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "gcc"
brew "git-delta"
brew "graphviz"
brew "hub"
brew "huggingface-cli"
brew "jq"
brew "k9s"
brew "lazygit"
brew "libmagic"
brew "llvm"
brew "luarocks"
brew "neovim"
brew "nvm"
brew "openjdk@17"
brew "poppler-qt5"
brew "pre-commit"
brew "protobuf"
brew "redis"
brew "ripgrep"
brew "ruff"
brew "starship"
brew "telnet"
brew "tree"
brew "utf8proc", args: ["HEAD"]
brew "uv"
brew "wget"
brew "zoxide"
brew "zsh-history-substring-search"
brew "cirruslabs/cli/tart"
brew "shopify/shopify/shopify-cli"
brew "shopify/shopify/themekit"
cask "jd-gui"
vscode "aldijav.golangwithdidi"
vscode "alefragnani.project-manager"
vscode "asvetliakov.vscode-neovim"
vscode "batisteo.vscode-django"
vscode "codezombiech.gitignore"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-database-client2"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "formulahendry.code-runner"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "honnamkuan.golang-snippets"
vscode "kevinrose.vsc-python-indent"
vscode "lorenzopirro.rust-flash-snippets"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "neonxp.gotools"
vscode "nhoizey.gremlins"
vscode "njpwerner.autodocstring"
vscode "openai.openai-chatgpt-adhoc"
vscode "premparihar.gotestexplorer"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tal7aouy.theme"
vscode "tauri-apps.tauri-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"
vscode "zxh404.vscode-proto3"
